# IsValidEdgeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..IsValidEdgeId Method
BRepBuilder Class See Also
---
A validator function that checks whether the edge id corresponds to an edge previously added to this BRepBuilder object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValidEdgeId(
	BRepBuilderGeometryId edgeId
)
```

Visual Basic
---
```text
Public Function IsValidEdgeId ( _
	edgeId As BRepBuilderGeometryId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidEdgeId(
	BRepBuilderGeometryId^ edgeId
)
```

# ### Parameters
edgeId
    Type: Autodesk.Revit.DB..::..BRepBuilderGeometryId Edge id to be validated.
# ### Return Value
True if edgeId corresponds to an edge previously added to this BRepBuilder, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace